app/controllers/school_classes_controller.rb

    def create
        @schoolclass = SchoolClass.create(params.require("school_class"))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Potions"], ["room_number", 364], ["created_at", "2018-05-01 15:08:57.071669"], ["updated_at", "2018-05-01 15:08:57.071669"]]

    def update
        @schoolclass = SchoolClass.find(params[:id])
        @schoolclass.update(params.require(:school_class))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "APUSH"], ["updated_at", "2018-05-01 15:28:32.724042"], ["id", 1]]