app/controllers/students_controller.rb

  def create
    @student = Student.create(params.require("student"))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Mike"], ["last_name", "Myung"], ["created_at", "2018-05-01 15:37:51.415428"], ["updated_at", "2018-05-01 15:37:51.415428"]]

  def update
    @student = Student.update(params[:id], params.require("student"))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Boy who"], ["last_name", "lived"], ["updated_at", "2018-05-01 15:41:30.701223"], ["id", 9]]